OpenDTEF-v2012/tutorials/lagrangian/reactingParcelFoam/rectangularChannel/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-9;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.16;
        value           uniform 3.75e-9;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-9;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
